feilongfl/hal_artery/at32f43x/drivers/src/at32f43x_xmc.c
  /* Set bk4tmgatt register value according to xmc_special_spacetiming_struct parameters */
  XMC_BANK4->bk4tmgatt = (uint32_t)xmc_special_spacetiming_struct->mem_setup_time |
                         (xmc_special_spacetiming_struct->mem_waite_time << 8) |
                         (xmc_special_spacetiming_struct->mem_hold_time << 16) |
                         (xmc_special_spacetiming_struct->mem_hiz_time << 24);

  /* Set bk4tmgio register value according to xmc_iospace_timing_struct parameters */
  XMC_BANK4->bk4tmgio = (uint32_t)xmc_iospace_timing_struct->mem_setup_time |
                        (xmc_iospace_timing_struct->mem_waite_time << 8) |
                        (xmc_iospace_timing_struct->mem_hold_time << 16) |
                        (xmc_iospace_timing_struct->mem_hiz_time << 24);
}
/**
  * @brief  fill each xmc_pccard_init_struct member with its default value.
  * @param  xmc_pccard_init_struct: pointer to a xmc_pccardinittype
  *         structure which will be initialized.
  * @retval none
  */
void xmc_pccard_default_para_init(xmc_pccard_init_type* xmc_pccard_init_struct)
{
  /* reset pccard init structure parameters values */
  xmc_pccard_init_struct->enable_wait = XMC_WAIT_OPERATION_DISABLE;
  xmc_pccard_init_struct->delay_time_ar = 0x0;
  xmc_pccard_init_struct->delay_time_cr = 0x0;

}
/**
  * @brief  fill each xmc_common_spacetiming_struct/xmc_attribute_spacetiming_struct
  *         and xmc_iospace_timing_struct member with its default value.
  * @param  xmc_regular_spacetiming_struct : pointer to a xmc_pccard_init_type
  *         structure that contains the configuration information for the xmc
  *         pccard bank.
  * @param  xmc_special_spacetiming_struct : pointer to a xmc_pccard_init_type
  *         structure that contains the configuration information for the xmc
  *         pccard bank.
  * @param  xmc_iospace_timing_struct : pointer to a xmc_pccard_init_type
  *         structure that contains the configuration information for the xmc
  *         pccard bank.
  * @retval none
  */
void xmc_pccard_timing_default_para_init(xmc_nand_pccard_timinginit_type* xmc_regular_spacetiming_struct,
                                         xmc_nand_pccard_timinginit_type* xmc_special_spacetiming_struct,
                                         xmc_nand_pccard_timinginit_type* xmc_iospace_timing_struct)
{
  xmc_regular_spacetiming_struct->class_bank = XMC_BANK4_PCCARD;
  xmc_regular_spacetiming_struct->mem_hold_time  = 0xFC;
  xmc_regular_spacetiming_struct->mem_waite_time = 0xFC;
  xmc_regular_spacetiming_struct->mem_setup_time = 0xFC;
  xmc_regular_spacetiming_struct->mem_hiz_time = 0xFC;
  xmc_special_spacetiming_struct->class_bank = XMC_BANK4_PCCARD;
  xmc_special_spacetiming_struct->mem_hold_time  = 0xFC;
  xmc_special_spacetiming_struct->mem_waite_time = 0xFC;
  xmc_special_spacetiming_struct->mem_setup_time = 0xFC;
  xmc_special_spacetiming_struct->mem_hiz_time = 0xFC;
  xmc_iospace_timing_struct->class_bank = XMC_BANK4_PCCARD;
  xmc_iospace_timing_struct->mem_hold_time = 0xFC;
  xmc_iospace_timing_struct->mem_waite_time = 0xFC;
  xmc_iospace_timing_struct->mem_setup_time = 0xFC;
  xmc_iospace_timing_struct->mem_hiz_time = 0xFC;
}
/**
  * @brief  enable or disable the pccard memory bank.
  * @param  new_state (TRUE or FALSE)
  * @retval none
  */
void xmc_pccard_enable(confirm_state new_state)
{
  /* enable the pccard bank4 by setting the en bit in the bk4ctrl register */
  XMC_BANK4->bk4ctrl_bit.en = new_state;
}

/**
  * @}
  */

#endif

/**
  * @}
  */

/**
  * @}
  */
